// ===========================================================================
// СРЕДНЕЕ АРИФМЕТИЧЕСКОЕ ИЗ МАССИВА ЧИСЕЛ (СУММИРОВАТЬ И ДЕЛИТЬ НА КОЛ-ВО)
// ===========================================================================
export const average = (array) => {
  return array.reduce((sum, value) => sum + value) / array.length;
}



// ===========================================================================
// ГРУППИРОВКА ЗНАЧЕНИЙ МАССИВА В ОБЪЕКТЕ
// ===========================================================================
export const groupValues = (array) => {
  return array.reduce(
    (accum, value) => ({
      // Spread-оператор (достать свойства объекта)
      ...accum,
      // Добавить новое свойство или перезаписать существующее свойство,
      // ...название которого содержится в переменной "value"
      // Значение — текущее значение (если свойство уже есть) или "0"
      // Прибавить к свойству "1"
      [value]: (accum[value] || 0) + 1,
    }),
    {}
  );
}



// ===========================================================================
// ОБХОД ВНУТРЬ МАССИВА
// ===========================================================================
export function multiplyAll(arr) {
  for (let i = 0; i < arr.length; i++) {
    for (let j = 0; j < arr[i].length; j++) {
      console.log( arr[i][j] );
    }
  }
}

console.log( multiplyAll([[1], [2], [3]]) )



// ===========================================================================
// РАЗБИВКА МАССИВА НА РАВНЫЕ ГРУППЫ
// ===========================================================================
const divideIntoGroups = (arr, L) => {
  return arr.reduce((acc, _, i, arr) => (!(i % L) ? [...acc, arr.slice(i, i + L)] : acc), []);
}

console.log( divideIntoGroups([1, 2, 3, 4, 5, 6], 2) )
