// =============================================================================
// ОСНОВНОЙ КОМПОНЕНТ
// =============================================================================

// 1. Импортировать зависимости
// 1.1. Функция ленивой загрузки
import { lazy } from "react"
// 1.2. Компонент-обертка для ленивого компонента
import { Suspense } from "react"


// 2. Создать ленивый компонент (импортировав с помощью "lazy")
const LazyComponent = lazy(() => import("./components/LazyComponent.js"))


// 3. Создать основной компонент
const App = () => {
  return (
    // 3.1. Ленивый компонент помещать в компонент-обёртку "Suspense"
    // 3.2. В "fallback" — компонент, отображающийся, пока грузится ленивый
    <Suspense fallback={<p>Загрузка...</p>}>
      {/* 3.3. Сам ленивый компонент */}
      <LazyComponent/>
    </Suspense>
  )
}

export default App;