// =====================================================================
// ИСПОЛЬЗОВАНИЕ ХУКА
// =====================================================================
// 0. ИМПОРТИРОВАТЬ ХУК
import useWindowSmaller from "./hooks/useWindowSmaller.js";

const App = () => {
  // 1. ВХОДНЫЕ ДАННЫЕ
  // 1.1. Контрольная точка размера экрана
  const size = 600;


  // 2. ПОЛУЧИТЬ ДОСТУП К ФУНКЦИОНАЛУ ХУКА
  // 2.1. Получить размер экрана (меньше ли 600px) и установить обработчик
  const isSmaller600 = useWindowSmaller(size);
  
  
  // 3. ИСПОЛЬЗОВАТЬ ДАННЫЕ ИЗ ХУКА
  return (<>
    <p>Ширина экрана <b>{isSmaller600 ? "меньше" : "больше"}</b> {size} пикселей</p>
  </>)
}

export default App;