// =============================================================================
// ВХОДЯЩИЕ ДАННЫЕ
// =============================================================================
const data = [1, [2], [3, [[4]]]]



// =============================================================================
// РЕКУРСИВНАЯ ФУНКЦИЯ
// =============================================================================
function func(par) {
  // ПРОСТОЙ СЛУЧАЙ
  // Если:
  // - Значение параметра — не массив, а число
  // Вернуть:
  // - Это значение в исходном виде
  if (Array.isArray(par) === false) {
    return par;
  }
  
  // СЛОЖНЫЙ СЛУЧАЙ
  // Если:
  // - Значение параметра — массив (все остальные случаи)
  // Сделать:
  // - Перебрать массив
  // - Для каждого элемента вызвать функцию, передав текущий элемент
  // - Результаты вызова функции собирать в пустой массив
  // Вернуть:
  // - Получившийся массив
  return par.reduce((accum, item) => accum.concat(func(item)), []);
}



// =============================================================================
// ВЫЗОВ ФУНКЦИИ
// =============================================================================
console.log( func(data) );