// =============================================================================
// Хук, работающий с контекстом "AuthContext" (получает из него данные)
// =============================================================================

// 1. Импортировать зависимости
// 1.1. Функция получения данных из контекста
import { useContext } from "react";
// 1.2. Контекст "AuthContext"
import { AuthContext } from "../hoc/AuthContext.js";


// 2. Создать хук
export const useAuth = () => {
  // 2.1. Получить данные из контекста "AuthContext"
  const context = useContext(AuthContext);
  // 2.2. Вернуть полученные данные
  return context;
}