// ===========================================================================
// 1. ИМПОРТЫ
// ===========================================================================
// 1.1. Express — для работы сервера
import express from "express";



// ===========================================================================
// 2. РОУТИНГ (ПРИЁМ/ОБРАБОТКА ЗАПРОСОВ — ОТПРАВКА ОТВЕТОВ)
// ===========================================================================
// 2.1. Получить роутер
const router = express.Router();

// 2.2. Обработать адрес "/" — Вернуть "html"
router.get("/", (req, res) => {
  res.send("<h1>Home page</h1>");
})



// ===========================================================================
// 3. ЭКСПОРТИРОВАТЬ РОУТЕР
// ===========================================================================
export default router;
